Voorbeeldberichten/Uitgiftewebservice/06_DO_Request.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope 
        xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
        xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
        xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Body>
        <dispatchDataRequest
                xmlns="http://www.broservices.nl/xsd/dsepl/1.0"
                xmlns:brocom="http://www.broservices.nl/xsd/brocommon/3.0"
                xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
                xsi:schemaLocation="http://www.broservices.nl/xsd/dsepl/1.0 ../../XSD/dsepl-messages.xsd">
            <!-- Disclaimer: dit voorbeeldbericht valideert tegen de XSD van de uitgifteservice.
                Het houdt geen rekening met bedrijfsregels en is mogelijkerwijs vaktechnisch/inhoudelijk niet voorbeeldig.
        
                Bovenstaand statement gebruikt een relatief pad naar een lokaal bestand als schemaLocation.
                Dit werkt prima zolang (de meest recente versie van) het betreffende XSD-bestand nog niet beschikbaar is op de officiële locatie.
                Het heeft de voorkeur bovenstaande schemaLocation te vervangen door onderstaande schemaLocation naar de officiële locatie zodra dit kan, of gebruik te maken van een schema catalog indien de gebruikte tooling dit ondersteunt.
                xsi:schemaLocation="http://www.broservices.nl/xsd/dsepl/1.0 https://schema.broservices.nl/xsd/dsepl/1.0/dsepl-messages.xsd">
            -->
            <brocom:requestReference>uitgifte-objectgegevens</brocom:requestReference>
            <brocom:broId>EPL123456789012</brocom:broId>
            <!-- value actueelHistorisch is currently not supported. -->
            <dataToBeDelivered>actueel</dataToBeDelivered>
        </dispatchDataRequest>
    </soap:Body>
</soap:Envelope>
