Voorbeeldberichten/Uitgiftewebservice/01_DC_Request_BoundingBox.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope 
        xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
        xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
        xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Body>
        <dispatchCharacteristicsRequest 
                xmlns="http://www.broservices.nl/xsd/dsepl/1.0"
                xmlns:brocom="http://www.broservices.nl/xsd/brocommon/3.0"
                xmlns:gml="http://www.opengis.net/gml/3.2"
                xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
				xsi:schemaLocation="http://www.broservices.nl/xsd/dsepl/1.0 ../../XSD/dsepl-messages.xsd">
            <!-- Disclaimer: dit voorbeeldbericht valideert tegen de XSD van de uitgifteservice.
                Het houdt geen rekening met bedrijfsregels en is mogelijkerwijs vaktechnisch/inhoudelijk niet voorbeeldig.
                xsi:schemaLocation="http://www.broservices.nl/xsd/dsepl/1.0 https://schema.broservices.nl/xsd/dsepl/1.0/dsepl-messages.xsd">
            -->
            <brocom:requestReference>uitgifte-kengegevens1</brocom:requestReference>
            <criteria>
                <brocom:deliveryAccountableParty>27376655</brocom:deliveryAccountableParty>
                <brocom:area>
                    <brocom:boundingBox srsName="urn:ogc:def:crs:EPSG::4258" srsDimension="2">
                        <gml:lowerCorner>50.8 3.0</gml:lowerCorner>
                        <gml:upperCorner>53.6 7.2</gml:upperCorner>
                    </brocom:boundingBox>
                </brocom:area>
                <miningActivity codeSpace="urn:bro:epl:MiningActivity">opslaanStof</miningActivity>
            </criteria>
        </dispatchCharacteristicsRequest>
    </soap:Body>
</soap:Envelope>
